app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("encrypted_password", "last_request_at", "created_at", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "client_id", "current_login_at", "persistence_token", "last_name", "login_count", "last_login_ip", "last_login_at", "email", "first_name") VALUES('7bd9e2085386167f6b577410443221419e7f5506d89c119f5c9238167cfc52640a3cf3e8f8f585cbf275c874eca37083ac7c8814acd6440dc077d1be40800f17', '2010-08-06 04:56:22', '2010-08-06 04:56:22', '2010-08-06 04:56:22', 0, '127.0.0.1', 'TS6as9ceOjeNuITv0Dy2', NULL, '2010-08-06 04:56:22', '32a691c11b2f4780a329d130f2fa4b6a04bf03720495007658ad16288610a8ce1d6410826d691341682eca69146db08d71d052e52492259accee3883199e227a', 'Farmer', 1, NULL, NULL, 'bpfarmer@gmail.com', 'Brendan')